# Вычислить число π c заданной точностью d
# Пример:
# - при d = 3, π = 3.141

d = int(input('Введите заданную точность: '))
pi = 0
for i in range(d):
    pi += (1 / (16 ** i))*(4 / (8 * i + 1) - 2 / (8 * i + 4) - 1 / (8 * i + 5) - 1 / (8 * i + 6))
print(round(pi, d)) 
